app/Controllers/Pengguna.php

SELECT *
FROM `data_pengguna`
---
    public function index()
    {
        $penggunas = new PenggunaModel();
        $data['pengguna'] = $penggunas->findAll();