app/Models/BongkarModel.php

    function getBongkar()
    {
        $query = $this->db->table('data_bongkar')
            ->join('data_kapal', 'data_bongkar.id_kapal = data_kapal.id')
            ->orderBy('id_bongkar', 'DESC')
            ->get();
---
SELECT *
FROM `data_bongkar`
JOIN `data_kapal` ON `data_bongkar`.`id_kapal` = `data_kapal`.`id`
ORDER BY `id_bongkar` DESC