app/Models/KapalModel.php

    function total_kapal() {
        $query = $this->table('data_kapal')
        ->where('tanggal_akhir_sipi >= CURDATE()')
        ->get();
---
SELECT *
FROM `data_kapal`
WHERE `tanggal_akhir_sipi` >= CURDATE()

    function kapal_expired() {
        $query = $this->table('data_kapal')
        ->where('tanggal_akhir_sipi < CURDATE()')
        ->get();
---
SELECT *
FROM `data_kapal`
WHERE `tanggal_akhir_sipi` < CURDATE()