app/Models/KeberangkatanModel.php

SELECT *
FROM `data_kapal`
WHERE `tanggal_akhir_sipi` >= CURDATE()
---
    function getKapal(){
        $query = $this->db->table('data_kapal')
        ->where('tanggal_akhir_sipi >= CURDATE()')
        ->get();