app/Models/OlahgerakModel.php

    function getOlahgerak()
    {
        $query = $this->db->table('data_olah_gerak')
            ->join('data_kapal', 'data_olah_gerak.id_kapal = data_kapal.id')
            ->join('data_tangkahan', 'data_olah_gerak.dermaga = data_tangkahan.id_tangkahan')
            ->orderBy('id_olah_gerak', 'DESC')
            ->get();
---
SELECT *
FROM `data_olah_gerak`
JOIN `data_kapal` ON `data_olah_gerak`.`id_kapal` = `data_kapal`.`id`
JOIN `data_tangkahan` ON `data_olah_gerak`.`dermaga` = `data_tangkahan`.`id_tangkahan`
ORDER BY `id_olah_gerak` DESC